/***************************************************************************************************
		Heightmap_conf_and_pd - Подмодуль Heightmap, благодаря которому, платформозависимые 
		функции и определения вынесены отдельно. Позволяет проводить отладку в любой среде
		и осуществлять быстрое портирование на любые платформы
***************************************************************************************************/
#ifndef _HEIGHT_MAP_CONF_AND_PD_
#define _HEIGHT_MAP_CONF_AND_PD_


/***********************************************
      Получить размер шага по долготе
***********************************************/
double GetMapProperties_MapStepLon(void);

/***********************************************
	  Получить размер шага по широт
***********************************************/
double GetMapProperties_MapStepLat(void);

/***********************************************
	  Получить долготу нулевой точки
***********************************************/
double GetMapProperties_NullPointLon(void);

/***********************************************
	  Получить широту нулевой точки
***********************************************/
double GetMapProperties_NullPointLat(void);

/***********************************************
 Получить число узловых точек сетки по долготе
***********************************************/
short GetMapProperties_LonCount(void);

/***********************************************
  Получить число узловых точек сетки по широте
***********************************************/
short GetMapProperties_LatCount(void);

/***********************************************
  Получить долготу точки приземления
***********************************************/
double GetTouchDownPointLon(void);

/***********************************************
  Получить широту точки приземления
***********************************************/
double GetTouchDownPointLat(void);

/*****************************************************************
 Узнать высоту в узловой точке с индексами (LON_INDEX, LAT_INDEX)
******************************************************************/
short GetMapProperties_Alt(unsigned int LON_INDEX, unsigned int LAT_INDEX);

#endif
