#include "Heightmap_conf_and_pd.h"


char map[320054];


/***********************************************
	  ѕолучить размер шага по долготе
***********************************************/
double GetMapProperties_MapStepLon(void)
{
	// ≈сли значение действительно в секундах, то нужно привести к градусам делением на 3600
	return (*(double*)(map + 46)) / 3600;
}


/***********************************************
	  ѕолучить размер шага по широт
***********************************************/
double GetMapProperties_MapStepLat(void)
{
	// ≈сли значение действительно в секундах, то нужно привести к градусам делением на 3600
	return (*(double*)(map + 38) / 3600);
}

/***********************************************
	  ѕолучить долготу нулевой точки
***********************************************/
double GetMapProperties_NullPointLon(void)
{
	return *(double*)(map + 30);
}

/***********************************************
	  ѕолучить широту нулевой точки
***********************************************/
double GetMapProperties_NullPointLat(void)
{
	return *(double*)(map + 22);
}

/***********************************************
 ѕолучить число узловых точек сетки по долготе
***********************************************/
short GetMapProperties_LonCount(void)
{
	return *(short*)(map + 20);
}


/***********************************************
  ѕолучить число узловых точек сетки по широте
***********************************************/
short GetMapProperties_LatCount(void)
{
	return *(short*)(map + 18);
}


/***********************************************
  ѕолучить долготу точки приземлени€
***********************************************/
double GetTouchDownPointLon(void)
{
	return 0;
}

/***********************************************
  ѕолучить широту точки приземлени€
***********************************************/
double GetTouchDownPointLat(void)
{
	return 0;
}

/*****************************************************************
 ”знать высоту в узловой точке с индексами (LON_INDEX, LAT_INDEX)
******************************************************************/
short GetMapProperties_Alt(unsigned int LON_INDEX, unsigned int LAT_INDEX)
{
	// ‘ормула дл€ расчета адреса чтени€ из пам€ти 54 + 800*(400 - 1 - j) + 2*i, 
	// где 800 - размер пакета высот, количество точек по широте, 54 размер информационного пакета лежащего перед картой в пам€ти
	return *(short*)(map + 54 + 800 * (400 - 1 - LAT_INDEX) + 2 * LON_INDEX);
}