#include "heightmap.platformdepend.h"


/***********************************************
  Получить размер шага по долготе
***********************************************/
double getLongitudeGridStep(void)
{

}

/***********************************************
  Получить размер шага по широт
***********************************************/
double getLatitudeGridStep(void)
{

}

/***********************************************
  Получить долготу нулевой точки
***********************************************/
double getBottomLeftLongitude(void)
{

}

/***********************************************
  Получить широту нулевой точки
***********************************************/
double getBottomLeftLatitude(void)
{

}

/***********************************************
  Получить число узловых точек сетки по долготе
***********************************************/
short getNumberOfLongitude(void)
{

}

/***********************************************
  Получить число узловых точек сетки по широте
***********************************************/
short getNumberOfLatitude(void)
{

}

/***********************************************
  Получить долготу точки приземлени¤
***********************************************/
double getTouchdownLongitude(void)
{

}

/***********************************************
  Получить широту точки приземлени¤
***********************************************/
double getTouchdownLatitude(void)
{

}

/****************************************************************************
  Узнать высоту в узловой точке с индексами (latitudeIndex, longitudeIndex)
****************************************************************************/
short getAltitudeOnJunctionPoint(unsigned int latitudeIndex, unsigned int longitudeIndex)
{

}
